lilag-dawg/OSS_MCU/BLE_p2pRouteur/STM32_WPAN/App/p2p_routeur_app.c
			P2P_Router_App_Context.NumberOfSensorNearbyStruct.CurrentPosition ++;

			if (P2P_Router_App_Context.NumberOfSensorNearbyStruct.CurrentPosition >= scannedDevicesPackage.numberOfScannedDevices){
				P2P_Router_App_Context.NumberOfSensorNearbyStruct.CurrentPosition = 0;
				printf("END OF PACKET\n\r");
			}

			EDS_STM_Update_Char(0x0000,(uint8_t *)&value);
		}

			break;
		case EDS_CONNEX_HAND_CARA_4:
		{
			uint8_t value[20];
			uint8_t index =  P2P_Router_App_Context.positionInUsedDevices;

			uint8_t isCadenceSupported = (uint8_t)((usedDeviceInformations[index].supportedDataType.cadence) << 4);
			uint8_t isSpeedSupported = (uint8_t)((usedDeviceInformations[index].supportedDataType.speed) << 3);
			uint8_t isPowerSupported = (uint8_t)((usedDeviceInformations[index].supportedDataType.power) << 2);
			uint8_t isBatteryupported = (uint8_t)((usedDeviceInformations[index].supportedDataType.battery) << 1);
			uint8_t isGearSupported = (uint8_t)((usedDeviceInformations[index].supportedDataType.gear));


			value[0] = (uint8_t)(isCadenceSupported + isSpeedSupported + isPowerSupported + isBatteryupported + isGearSupported);

			for(int i = 1; i<(sizeof(value));i++){
				value[i] = (uint8_t)(usedDeviceInformations[index].name[i-1]);
			}

			P2P_Router_App_Context.positionInUsedDevices ++;

			if (P2P_Router_App_Context.positionInUsedDevices >= sizeof(usedDeviceInformations)/ sizeof(usedDeviceInformations[0])){
				P2P_Router_App_Context.positionInUsedDevices = 0;
			}


			EDS_STM_Update_Char(0x0003,(uint8_t *)&value);

		}
			break;
	    default:

	        break;
	}

    return;
}

/**
 * @brief  Feature Characteristic update
 * @param  pFeatureValue: The address of the new value to be written
 * @retval None
 */

static void Client_Update_Service( void )
{
	  uint16_t enable = 0x0001;
	  uint16_t disable = 0x0000;

	  uint8_t index;

	  index = 0;
	  while((index < BLE_CFG_CLT_MAX_NBR_CB) &&
	          (usedDeviceInformations[index].state != APP_BLE_IDLE))
	  {


	    switch(usedDeviceInformations[index].state)
	    {

	      case APP_BLE_DISCOVER_SERVICES:
	        APP_DBG_MSG("P2P_DISCOVER_SERVICES\n");
	        break;
	      case APP_BLE_DISCOVER_CHARACS:
	    	  switch(usedDeviceInformations[index].sensorType){
	    	  case CSC_SENSOR:
	    	  {

	    		  APP_DBG_MSG("* GATT : Discover P2P Characteristics csc_sensor\n");
				  int cscIndex =  usedDeviceInformations[index].getServiceIndex(CYCLING_SPEED_CADENCE_SERVICE_UUID, &usedDeviceInformations[index]);
	    		  int batteryIndex =  usedDeviceInformations[index].getServiceIndex(BATTERY_SERVICE_UUID, &usedDeviceInformations[index]);


				  if(usedDeviceInformations[index].services[cscIndex].isCharHandleEmpty(&usedDeviceInformations[index].services[cscIndex])){

					  aci_gatt_disc_all_char_of_service(usedDeviceInformations[index].connHandle,
							  	  	  	  	  	  	  usedDeviceInformations[index].services[cscIndex].servHandle,
													  usedDeviceInformations[index].services[cscIndex].servEndHandle);
				  }
				  else if(usedDeviceInformations[index].services[batteryIndex].isCharHandleEmpty(&usedDeviceInformations[index].services[batteryIndex])){

					  aci_gatt_disc_all_char_of_service(usedDeviceInformations[index].connHandle,
							  	  	  	  	  	  	  usedDeviceInformations[index].services[batteryIndex].servHandle,
													  usedDeviceInformations[index].services[batteryIndex].servEndHandle);
				  }
				  else
				  {
					  usedDeviceInformations[index].state = APP_BLE_DISCOVER_NOTIFICATION_CHAR_DESC;
					  Client_Update_Service();
				  }
	    	  }
				  break;
	    	  case POWER_SENSOR:
				  break;
	    	  case TRAINER:
				  APP_DBG_MSG("* GATT : Discover P2P Characteristics trainer\n");

				  int powerIndex =  usedDeviceInformations[index].getServiceIndex(CYCLING_POWER_SERVICE_UUID, &usedDeviceInformations[index]);
				  int cscIndex =  usedDeviceInformations[index].getServiceIndex(CYCLING_SPEED_CADENCE_SERVICE_UUID, &usedDeviceInformations[index]);

				  if(usedDeviceInformations[index].services[powerIndex].isCharHandleEmpty(&usedDeviceInformations[index].services[powerIndex])){

					  aci_gatt_disc_all_char_of_service(usedDeviceInformations[index].connHandle,
							  	  	  	  	  	  	  usedDeviceInformations[index].services[powerIndex].servHandle,
													  usedDeviceInformations[index].services[powerIndex].servEndHandle);
				  }
				  else if(usedDeviceInformations[index].services[cscIndex].isCharHandleEmpty(&usedDeviceInformations[index].services[cscIndex])){

					  aci_gatt_disc_all_char_of_service(usedDeviceInformations[index].connHandle,
							  	  	  	  	  	  	  usedDeviceInformations[index].services[cscIndex].servHandle,
													  usedDeviceInformations[index].services[cscIndex].servEndHandle);
				  }
				  else
				  {
					  usedDeviceInformations[index].state = APP_BLE_DISCOVER_NOTIFICATION_CHAR_DESC;
					  Client_Update_Service();
				  }

				  break;
	    	  case SHIMANO_SENSOR:
	    		  APP_DBG_MSG("* GATT : Discover P2P Characteristics shimano\n");

	    		  int positionIndex =  usedDeviceInformations[index].getServiceIndex(SHIMANO_SERVICE_UUID, &usedDeviceInformations[index]);
	    		  int batteryIndex =  usedDeviceInformations[index].getServiceIndex(BATTERY_SERVICE_UUID, &usedDeviceInformations[index]);

				  if(usedDeviceInformations[index].services[positionIndex].isCharHandleEmpty(&usedDeviceInformations[index].services[positionIndex])){

					  aci_gatt_disc_all_char_of_service(usedDeviceInformations[index].connHandle,
							  	  	  	  	  	  	  usedDeviceInformations[index].services[positionIndex].servHandle,
													  usedDeviceInformations[index].services[positionIndex].servEndHandle);
				  }
				  else if(usedDeviceInformations[index].services[batteryIndex].isCharHandleEmpty(&usedDeviceInformations[index].services[batteryIndex])){

					  aci_gatt_disc_all_char_of_service(usedDeviceInformations[index].connHandle,
							  	  	  	  	  	  	  usedDeviceInformations[index].services[batteryIndex].servHandle,
													  usedDeviceInformations[index].services[batteryIndex].servEndHandle);
				  }
				  else
				  {
					  usedDeviceInformations[index].state = APP_BLE_DISCOVER_NOTIFICATION_CHAR_DESC;
					  Client_Update_Service();
				  }

				  break;
	    	  default:
	    		  APP_DBG_MSG("* TYPE DE CAPTEUR NON RECONNU\n");
	    		  break;
	    	  }
	        break;

	      case APP_BLE_DISCOVER_NOTIFICATION_CHAR_DESC:
	    	  switch(usedDeviceInformations[index].sensorType){
	    	  case TRAINER:
	    	  {
				  int powerIndex =  usedDeviceInformations[index].getServiceIndex(CYCLING_POWER_SERVICE_UUID, &usedDeviceInformations[index]);
				  int cscIndex =  usedDeviceInformations[index].getServiceIndex(CYCLING_SPEED_CADENCE_SERVICE_UUID, &usedDeviceInformations[index]);

				  if(usedDeviceInformations[index].services[powerIndex].isDescHandleEmpty(&usedDeviceInformations[index].services[powerIndex])){

				      APP_DBG_MSG("* GATT : Discover Descriptor of Rx - Notification Characteritic - POWER\n");
					  int powerCharIdx = usedDeviceInformations[index].services[powerIndex].getCharacteristicIndex(CYCLING_POWER_MEASUREMENT_CHAR_UUID, &usedDeviceInformations[index].services[powerIndex]);
					  usedDeviceInformations[index].currentReadingInfo.serviceName = CYCLING_POWER_SERVICE_UUID;
					  usedDeviceInformations[index].currentReadingInfo.serv_idx = powerIndex;
					  usedDeviceInformations[index].currentReadingInfo.charName = CYCLING_POWER_MEASUREMENT_CHAR_UUID;
					  usedDeviceInformations[index].currentReadingInfo.char_idx = powerCharIdx;

					  aci_gatt_disc_all_char_desc(usedDeviceInformations[index].connHandle,
							  	  	  	  	  	  	  usedDeviceInformations[index].services[powerIndex].characteristics[powerCharIdx].charHandle,
													  usedDeviceInformations[index].services[powerIndex].characteristics[powerCharIdx].charHandle+2);
				  }
				  else if(usedDeviceInformations[index].services[cscIndex].isDescHandleEmpty(&usedDeviceInformations[index].services[cscIndex])){

				      APP_DBG_MSG("* GATT : Discover Descriptor of Rx - Notification Characteritic - CSC\n");
					  int cscCharIdx = usedDeviceInformations[index].services[cscIndex].getCharacteristicIndex(CYCLING_SPEED_CADENCE_MEASUREMENT_CHAR_UUID, &usedDeviceInformations[index].services[cscIndex]);
					  usedDeviceInformations[index].currentReadingInfo.serviceName = CYCLING_SPEED_CADENCE_SERVICE_UUID;
					  usedDeviceInformations[index].currentReadingInfo.serv_idx = cscIndex;
					  usedDeviceInformations[index].currentReadingInfo.charName = CYCLING_SPEED_CADENCE_MEASUREMENT_CHAR_UUID;
					  usedDeviceInformations[index].currentReadingInfo.char_idx = cscCharIdx;

					  aci_gatt_disc_all_char_desc(usedDeviceInformations[index].connHandle,
							  	  	  	  	  	  	  usedDeviceInformations[index].services[cscIndex].characteristics[cscCharIdx].charHandle,
													  usedDeviceInformations[index].services[cscIndex].characteristics[cscCharIdx].charHandle+2);
				  }
				  else
				  {
					  memset(&usedDeviceInformations[index].currentReadingInfo, 0, sizeof(usedDeviceInformations[index].currentReadingInfo));
					  usedDeviceInformations[index].state = APP_BLE_ENABLE_NOTIFICATION_DESC;
					  Client_Update_Service();
				  }
	    	  }
				  break;
	    	  case SHIMANO_SENSOR:
	    	  {
				  int positionIndex =  usedDeviceInformations[index].getServiceIndex(SHIMANO_SERVICE_UUID, &usedDeviceInformations[index]);
				  int batteryIndex =  usedDeviceInformations[index].getServiceIndex(BATTERY_SERVICE_UUID, &usedDeviceInformations[index]);

				  if(usedDeviceInformations[index].services[positionIndex].isDescHandleEmpty(&usedDeviceInformations[index].services[positionIndex])){

				      APP_DBG_MSG("* GATT : Discover Descriptor of Rx - Notification Characteritic - Position\n");
					  int positionCharIdx = usedDeviceInformations[index].services[positionIndex].getCharacteristicIndex(SHIMANO_CHAR_UUID, &usedDeviceInformations[index].services[positionIndex]);
					  usedDeviceInformations[index].currentReadingInfo.serviceName = SHIMANO_SERVICE_UUID;
					  usedDeviceInformations[index].currentReadingInfo.serv_idx = positionIndex;
					  usedDeviceInformations[index].currentReadingInfo.charName = SHIMANO_CHAR_UUID;
					  usedDeviceInformations[index].currentReadingInfo.char_idx = positionCharIdx;

					  aci_gatt_disc_all_char_desc(usedDeviceInformations[index].connHandle,
							  	  	  	  	  	  	  usedDeviceInformations[index].services[positionIndex].characteristics[positionCharIdx].charHandle,
													  usedDeviceInformations[index].services[positionIndex].characteristics[positionCharIdx].charHandle+2);
				  }
				  else if(usedDeviceInformations[index].services[batteryIndex].isDescHandleEmpty(&usedDeviceInformations[index].services[batteryIndex])){

				      APP_DBG_MSG("* GATT : Discover Descriptor of Rx - Notification Characteritic - Battery\n");
					  int batteryCharIdx = usedDeviceInformations[index].services[batteryIndex].getCharacteristicIndex(BATTERY_LEVEL_CHAR_UUID, &usedDeviceInformations[index].services[batteryIndex]);
					  usedDeviceInformations[index].currentReadingInfo.serviceName = BATTERY_SERVICE_UUID;
					  usedDeviceInformations[index].currentReadingInfo.serv_idx = batteryIndex;
					  usedDeviceInformations[index].currentReadingInfo.charName = BATTERY_LEVEL_CHAR_UUID;
					  usedDeviceInformations[index].currentReadingInfo.char_idx = batteryCharIdx;

					  aci_gatt_disc_all_char_desc(usedDeviceInformations[index].connHandle,
							  	  	  	  	  	  	  usedDeviceInformations[index].services[batteryIndex].characteristics[batteryCharIdx].charHandle,
													  usedDeviceInformations[index].services[batteryIndex].characteristics[batteryCharIdx].charHandle+2);
				  }
				  else
				  {
					  memset(&usedDeviceInformations[index].currentReadingInfo, 0, sizeof(usedDeviceInformations[index].currentReadingInfo));
					  usedDeviceInformations[index].state = APP_BLE_ENABLE_NOTIFICATION_DESC;
					  Client_Update_Service();
				  }
	    	  }
				  break;
	    	  case CSC_SENSOR:
	    	  {
				  int cscIndex =  usedDeviceInformations[index].getServiceIndex(CYCLING_SPEED_CADENCE_SERVICE_UUID, &usedDeviceInformations[index]);
				  int batteryIndex =  usedDeviceInformations[index].getServiceIndex(BATTERY_SERVICE_UUID, &usedDeviceInformations[index]);

				  if(usedDeviceInformations[index].services[cscIndex].isDescHandleEmpty(&usedDeviceInformations[index].services[cscIndex])){

				      APP_DBG_MSG("* GATT : Discover Descriptor of Rx - Notification Characteritic - CSC\n");
					  int cscCharIdx = usedDeviceInformations[index].services[cscIndex].getCharacteristicIndex(CYCLING_SPEED_CADENCE_MEASUREMENT_CHAR_UUID, &usedDeviceInformations[index].services[cscIndex]);
					  usedDeviceInformations[index].currentReadingInfo.serviceName = CYCLING_SPEED_CADENCE_SERVICE_UUID;
					  usedDeviceInformations[index].currentReadingInfo.serv_idx = cscIndex;
					  usedDeviceInformations[index].currentReadingInfo.charName = CYCLING_SPEED_CADENCE_MEASUREMENT_CHAR_UUID;
					  usedDeviceInformations[index].currentReadingInfo.char_idx = cscCharIdx;

					  aci_gatt_disc_all_char_desc(usedDeviceInformations[index].connHandle,
							  	  	  	  	  	  	  usedDeviceInformations[index].services[cscIndex].characteristics[cscCharIdx].charHandle,
													  usedDeviceInformations[index].services[cscIndex].characteristics[cscCharIdx].charHandle+2);
				  }
				  else if(usedDeviceInformations[index].services[batteryIndex].isDescHandleEmpty(&usedDeviceInformations[index].services[batteryIndex])){

				      APP_DBG_MSG("* GATT : Discover Descriptor of Rx - Notification Characteritic - Battery\n");
					  int batteryCharIdx = usedDeviceInformations[index].services[batteryIndex].getCharacteristicIndex(BATTERY_LEVEL_CHAR_UUID, &usedDeviceInformations[index].services[batteryIndex]);
					  usedDeviceInformations[index].currentReadingInfo.serviceName = BATTERY_SERVICE_UUID;
					  usedDeviceInformations[index].currentReadingInfo.serv_idx = batteryIndex;
					  usedDeviceInformations[index].currentReadingInfo.charName = BATTERY_LEVEL_CHAR_UUID;
					  usedDeviceInformations[index].currentReadingInfo.char_idx = batteryCharIdx;

					  aci_gatt_disc_all_char_desc(usedDeviceInformations[index].connHandle,
							  	  	  	  	  	  	  usedDeviceInformations[index].services[batteryIndex].characteristics[batteryCharIdx].charHandle,
													  usedDeviceInformations[index].services[batteryIndex].characteristics[batteryCharIdx].charHandle+2);
				  }
				  else
				  {
					  memset(&usedDeviceInformations[index].currentReadingInfo, 0, sizeof(usedDeviceInformations[index].currentReadingInfo));
					  usedDeviceInformations[index].state = APP_BLE_ENABLE_NOTIFICATION_DESC;
					  Client_Update_Service();
				  }
	    	  }
				  break;

	    	  default:
	    		  APP_DBG_MSG("* TYPE DE CAPTEUR NON RECONNU\n");
	    		  break;
	    	  }
	        break;
	      case APP_BLE_READ_CHARACS:
	        APP_DBG_MSG("* GATT : Discover Reading characs - \n");
	        break;

