lilag-dawg/OSS_MCU/BLE_p2pRouteur/STM32_WPAN/App/p2p_routeur_app.c
	      case APP_BLE_ENABLE_NOTIFICATION_DESC:
	    	  switch(usedDeviceInformations[index].sensorType){
	    	  case TRAINER:
	    	  {
	    		  // index for services
				  int powerIndex =  usedDeviceInformations[index].getServiceIndex(CYCLING_POWER_SERVICE_UUID, &usedDeviceInformations[index]);
				  int cscIndex =  usedDeviceInformations[index].getServiceIndex(CYCLING_SPEED_CADENCE_SERVICE_UUID, &usedDeviceInformations[index]);

				  // index for characteristics
				  int powerCharIdx = usedDeviceInformations[index].services[powerIndex].getCharacteristicIndex(CYCLING_POWER_MEASUREMENT_CHAR_UUID, &usedDeviceInformations[index].services[powerIndex]);
				  int cscCharIdx = usedDeviceInformations[index].services[cscIndex].getCharacteristicIndex(CYCLING_SPEED_CADENCE_MEASUREMENT_CHAR_UUID, &usedDeviceInformations[index].services[cscIndex]);

				  if(!usedDeviceInformations[index].services[powerIndex].characteristics[powerCharIdx].isNotifying){

					  usedDeviceInformations[index].services[powerIndex].characteristics[powerCharIdx].isNotifying = true;
				      APP_DBG_MSG("* GATT : Enable Server CP notif\n");
				      aci_gatt_write_char_desc(usedDeviceInformations[index].connHandle,
				        					   usedDeviceInformations[index].services[powerIndex].characteristics[powerCharIdx].descHandle,
				                               2,
				                               (uint8_t *)&enable);
				  }
				  else if(!usedDeviceInformations[index].services[cscIndex].characteristics[cscCharIdx].isNotifying){

					  usedDeviceInformations[index].services[cscIndex].characteristics[cscCharIdx].isNotifying = true;
					  APP_DBG_MSG("* GATT : Enable Server CSC notif\n");
				      aci_gatt_write_char_desc(usedDeviceInformations[index].connHandle,
				        					   usedDeviceInformations[index].services[cscIndex].characteristics[cscCharIdx].descHandle,
				                               2,
				                               (uint8_t *)&enable);
				  }
				  else{
					  usedDeviceInformations[index].state = APP_BLE_CONNECTED_CLIENT;
				  }

	    	  }
				  break;

	    	  case SHIMANO_SENSOR:
	    	  {
	    		  // index for services
				  int posistionIndex =  usedDeviceInformations[index].getServiceIndex(SHIMANO_SERVICE_UUID, &usedDeviceInformations[index]);

				  // index for characteristics
				  int positionCharIdx = usedDeviceInformations[index].services[posistionIndex].getCharacteristicIndex(SHIMANO_CHAR_UUID, &usedDeviceInformations[index].services[posistionIndex]);

				  if(!usedDeviceInformations[index].services[posistionIndex].characteristics[positionCharIdx].isNotifying){

					  usedDeviceInformations[index].services[posistionIndex].characteristics[positionCharIdx].isNotifying = true;
				      APP_DBG_MSG("* GATT : Enable Server Position notif\n");
				      aci_gatt_write_char_desc(usedDeviceInformations[index].connHandle,
				        					   usedDeviceInformations[index].services[posistionIndex].characteristics[positionCharIdx].descHandle,
				                               2,
				                               (uint8_t *)&enable);
				  }
				  else{
					  usedDeviceInformations[index].state = APP_BLE_CONNECTED_CLIENT;
				  }

	    	  }
				  break;
	    	  case CSC_SENSOR:
	    	  {
	    		  // index for services
				  int cscIndex =  usedDeviceInformations[index].getServiceIndex(CYCLING_SPEED_CADENCE_SERVICE_UUID, &usedDeviceInformations[index]);

				  // index for characteristics
				  int cscCharIdx = usedDeviceInformations[index].services[cscIndex].getCharacteristicIndex(CYCLING_SPEED_CADENCE_MEASUREMENT_CHAR_UUID, &usedDeviceInformations[index].services[cscIndex]);

				  if(!usedDeviceInformations[index].services[cscIndex].characteristics[cscCharIdx].isNotifying){

					  usedDeviceInformations[index].services[cscIndex].characteristics[cscCharIdx].isNotifying = true;
				      APP_DBG_MSG("* GATT : Enable Server CSC notif\n");
				      aci_gatt_write_char_desc(usedDeviceInformations[index].connHandle,
				        					   usedDeviceInformations[index].services[cscIndex].characteristics[cscCharIdx].descHandle,
				                               2,
				                               (uint8_t *)&enable);
				  }
				  else{
					  usedDeviceInformations[index].state = APP_BLE_CONNECTED_CLIENT;
				  }

	    	  }
				  break;

	    	  default:
	    		  APP_DBG_MSG("* TYPE DE CAPTEUR NON RECONNU\n");
	    		  break;
	    	  }

	        break;
	      default:
	        break;
	    }
	    index++;
	  }
	  return;
}

static SVCCTL_EvtAckStatus_t Client_Event_Handler(void *Event)
{
    /* USER CODE BEGIN Client_Event_Handler_1 */

    /* USER CODE END Client_Event_Handler_1 */
    SVCCTL_EvtAckStatus_t return_value;
    hci_event_pckt *event_pckt;
    evt_blue_aci *blue_evt;
    P2P_Client_App_Notification_evt_t Notification;
    return_value = SVCCTL_EvtNotAck;
    event_pckt = (hci_event_pckt *)(((hci_uart_pckt*)Event)->data);


    switch(event_pckt->evt)
    {
        case EVT_VENDOR:
        {
            /* USER CODE BEGIN EVT_VENDOR */

            /* USER CODE END EVT_VENDOR */
            blue_evt = (evt_blue_aci*)event_pckt->data;
            switch(blue_evt->ecode)
            {
            /* USER CODE BEGIN ecode */

            /* USER CODE END ecode */
                case EVT_BLUE_ATT_READ_BY_GROUP_TYPE_RESP:
                {
                    /* USER CODE BEGIN EVT_BLUE_ATT_READ_BY_GROUP_TYPE_RESP */
                    bool uuid_bit_format = 0;
                	settings_t readSettings;
                	readFlash((uint8_t*)&readSettings);

                    /* USER CODE END EVT_BLUE_ATT_READ_BY_GROUP_TYPE_RESP */
                    aci_att_read_by_group_type_resp_event_rp0 *pr = (void*)blue_evt->data;
                    uint8_t numServ, i, idx;
                    uint16_t uuid, handle;

                    uint8_t index;
                    handle = pr->Connection_Handle;
                    index = 0;
                    while((index < BLE_CFG_CLT_MAX_NBR_CB) &&
                            (usedDeviceInformations[index].state != APP_BLE_IDLE) &&
                        (usedDeviceInformations[index].connHandle != handle))
                    {
                        index++;
                    }
                    //Debut format 128bit ou 16bit
                    	switch(pr->Attribute_Data_Length)
                    	{
                    	case 20:
                    		uuid_bit_format = 1;
                    		break;
                    	case 6:
                    		uuid_bit_format = 0;
                    		break;
                    	default:

                    	break;
                    	}
                    //Fin format 128 bit ou 16 bit

