lilag-dawg/OSS_MCU/BLE_p2pRouteur/STM32_WPAN/App/p2p_routeur_app.c
                    if(index < BLE_CFG_CLT_MAX_NBR_CB)
                    {
                    	usedDeviceInformations[index].connHandle= handle;
                        numServ = (pr->Data_Length) / pr->Attribute_Data_Length;
                        /* the event data will be
                         * 2bytes start handle
                         * 2bytes end handle
                         * 2 or 16 bytes data
                         * we are intersted only if the UUID is 16 bit.
                         * So check if the data length is 6
                         * we are intersted only if the UUID is 128 bit.
                         * So check if the data length is 20
                         */

                                if (uuid_bit_format==1){idx = 16;}
                                else if (uuid_bit_format==0){idx = 4;}

                                if (pr->Attribute_Data_Length == 20 || pr->Attribute_Data_Length == 6)
                                {

                                for (i=0; i<numServ; i++)
                                {
                                    uuid = UNPACK_2_BYTE_PARAMETER(&pr->Attribute_Data_List[idx]);
                                    switch(uuid)
                                    {
                                    	case(CYCLING_SPEED_CADENCE_SERVICE_UUID ):
										{
                                    		usedDeviceInformations[index].supportedDataType.cadence = true;
                                    		usedDeviceInformations[index].supportedDataType.speed = true;
#if(CFG_DEBUG_APP_TRACE != 0)
											APP_DBG_MSG("-- GATT : CSC_SERVICE_UUID FOUND -\n");
#endif
											int serv_idx = usedDeviceInformations[index].appendServiceName(CYCLING_SPEED_CADENCE_SERVICE_UUID, &usedDeviceInformations[index]);
											if(serv_idx >= 0){
												usedDeviceInformations[index].services[serv_idx].servHandle = UNPACK_2_BYTE_PARAMETER(&pr->Attribute_Data_List[idx-4]);
												usedDeviceInformations[index].services[serv_idx].servEndHandle = UNPACK_2_BYTE_PARAMETER (&pr->Attribute_Data_List[idx-2]);
											}
											break;
										}
										case(CYCLING_POWER_SERVICE_UUID):
										{
											usedDeviceInformations[index].supportedDataType.power = true;

#if(CFG_DEBUG_APP_TRACE != 0)
											APP_DBG_MSG("-- GATT : CYCLING_POWER_SERVICE_UUID FOUND - \n");
#endif

											int serv_idx = usedDeviceInformations[index].appendServiceName(CYCLING_POWER_SERVICE_UUID, &usedDeviceInformations[index]);
											if(serv_idx >= 0){
												usedDeviceInformations[index].services[serv_idx].servHandle = UNPACK_2_BYTE_PARAMETER(&pr->Attribute_Data_List[idx-4]);
												usedDeviceInformations[index].services[serv_idx].servEndHandle = UNPACK_2_BYTE_PARAMETER (&pr->Attribute_Data_List[idx-2]);
											}

											break;
										}
										case(BATTERY_SERVICE_UUID):
										{
											usedDeviceInformations[index].supportedDataType.battery = true;
											int serv_idx = usedDeviceInformations[index].appendServiceName(BATTERY_SERVICE_UUID, &usedDeviceInformations[index]);
											if(serv_idx >= 0){
												usedDeviceInformations[index].services[serv_idx].servHandle = UNPACK_2_BYTE_PARAMETER(&pr->Attribute_Data_List[idx-4]);
												usedDeviceInformations[index].services[serv_idx].servEndHandle = UNPACK_2_BYTE_PARAMETER (&pr->Attribute_Data_List[idx-2]);
											}
											break;
										}
                                    	case(SHIMANO_SERVICE_UUID ):
                                    	{
#if(CFG_DEBUG_APP_TRACE != 0)
											APP_DBG_MSG("-- GATT : SENSOR_SERVICE_UUID FOUND - \n");
#endif
											usedDeviceInformations[index].supportedDataType.gear = true;
											int serv_idx = usedDeviceInformations[index].appendServiceName(SHIMANO_SERVICE_UUID, &usedDeviceInformations[index]);
											if(serv_idx >= 0){
												usedDeviceInformations[index].services[serv_idx].servHandle = UNPACK_2_BYTE_PARAMETER(&pr->Attribute_Data_List[idx-16]);
												usedDeviceInformations[index].services[serv_idx].servEndHandle = UNPACK_2_BYTE_PARAMETER (&pr->Attribute_Data_List[idx-14]);
											}

                                    		break;
                                    	}
                                    	default:
                                    		break;
                                    }
                                    idx += 6;
                                }
								if (usedDeviceInformations[index].supportedDataType.cadence == true &&
										usedDeviceInformations[index].supportedDataType.speed == true &&
										usedDeviceInformations[index].supportedDataType.power == true)
								{
									usedDeviceInformations[index].sensorType = TRAINER;
									usedDeviceInformations[index].state = APP_BLE_DISCOVER_CHARACS ;
									//usedDeviceInformations[index].sensor_evt_type = P2P_NOTIFICATION_CP_RECEIVED_EVT;
								}
								else if(usedDeviceInformations[index].supportedDataType.cadence == true &&
										usedDeviceInformations[index].supportedDataType.speed == true &&
										usedDeviceInformations[index].supportedDataType.power == false)
								{
									usedDeviceInformations[index].sensorType = CSC_SENSOR;
									usedDeviceInformations[index].state = APP_BLE_DISCOVER_CHARACS ;
									//usedDeviceInformations[index].sensor_evt_type = P2P_NOTIFICATION_CSC_RECEIVED_EVT;
								}
								else if(usedDeviceInformations[index].supportedDataType.cadence == false &&
										usedDeviceInformations[index].supportedDataType.speed == false &&
										usedDeviceInformations[index].supportedDataType.power == true)
								{
									usedDeviceInformations[index].sensorType = POWER_SENSOR;
									usedDeviceInformations[index].state = APP_BLE_DISCOVER_CHARACS ;
									//usedDeviceInformations[index].sensor_evt_type = P2P_NOTIFICATION_CP_RECEIVED_EVT;
								}
								else if(usedDeviceInformations[index].supportedDataType.gear == true){

									usedDeviceInformations[index].sensorType = SHIMANO_SENSOR;
									usedDeviceInformations[index].state = APP_BLE_DISCOVER_CHARACS ;
									//usedDeviceInformations[index].sensor_evt_type = P2P_NOTIFICATION_SHIMANO_RECEIVED_EVT;
								}
								else{
									usedDeviceInformations[index].sensorType = OTHER;
								}
                            }
                        }
                    }
                    break;

