lilag-dawg/OSS_MCU/BLE_p2pRouteur/STM32_WPAN/App/p2p_routeur_app.c
                case EVT_BLUE_ATT_READ_BY_TYPE_RESP:
                {
                    /* USER CODE BEGIN EVT_BLUE_ATT_READ_BY_TYPE_RESP */
                	bool uuid_format_char = 0;
                    /* USER CODE END EVT_BLUE_ATT_READ_BY_TYPE_RESP */
                    aci_att_read_by_type_resp_event_rp0 *pr = (void*)blue_evt->data;

                    uint8_t idx;
                    uint16_t uuid, handle;

                    /* the event data will be
                     * 2 bytes start handle
                     * 1 byte char properties
                     * 2 bytes handle
                     * 2 or 16 bytes data
                     */

                    uint8_t index;

                    index = 0;

                    while((index < BLE_CFG_CLT_MAX_NBR_CB) &&
                            (usedDeviceInformations[index].connHandle != pr->Connection_Handle))
                    {
                        index++;
                    }


                    if(index < BLE_CFG_CLT_MAX_NBR_CB)
                    {

                        //Debut format 128bit ou 16bit
                        	switch(pr->Handle_Value_Pair_Length)
                        	{
                        	case 21:
                        		uuid_format_char = 1;
                        		break;
                        	case 7:
                        		uuid_format_char = 0;
                        		break;
                        	default:

                        	break;
                        	}
                        //Fin format 128 bit ou 16 bit

                          /* we are not just interested in only 16 bit UUIDs */
                          if (uuid_format_char == 1){idx=17;}
                          else if (uuid_format_char==0){idx=5;}


                        if(pr->Handle_Value_Pair_Length == 21 || pr->Handle_Value_Pair_Length == 7)

                        {

                        	pr->Data_Length -= 1;
                            while(pr->Data_Length > 0)
                            {
                                uuid = UNPACK_2_BYTE_PARAMETER(&pr->Handle_Value_Pair_Data[idx]);
                                /* store the characteristic handle not the attribute handle */

                                if(uuid_format_char==1){handle = UNPACK_2_BYTE_PARAMETER(&pr->Handle_Value_Pair_Data[idx-14]);}
                                else if(uuid_format_char==0){handle = UNPACK_2_BYTE_PARAMETER(&pr->Handle_Value_Pair_Data[idx-2]);}

                                if(uuid == CYCLING_SPEED_CADENCE_MEASUREMENT_CHAR_UUID && (usedDeviceInformations[index].sensorType == TRAINER || usedDeviceInformations[index].sensorType == CSC_SENSOR))
                                {
#if(CFG_DEBUG_APP_TRACE != 0)
                                	  APP_DBG_MSG("-- GATT : CSC_NOTIFY_CHAR_UUID FOUND  - \n");
#endif
                                	  int serv_idx = usedDeviceInformations[index].getServiceIndex(CYCLING_SPEED_CADENCE_SERVICE_UUID,&usedDeviceInformations[index]);
                                	  int charac_idx = usedDeviceInformations[index].services[serv_idx].appendCharacteristicName(CYCLING_SPEED_CADENCE_MEASUREMENT_CHAR_UUID,
                                			  &usedDeviceInformations[index].services[serv_idx]);

                                	  if(charac_idx >= 0 ){
                                		  usedDeviceInformations[index].services[serv_idx].characteristics[charac_idx].charHandle = handle;
                                	  }
                                }
                                if(uuid == SHIMANO_CHAR_UUID && (usedDeviceInformations[index].sensorType == SHIMANO_SENSOR)){
#if(CFG_DEBUG_APP_TRACE != 0)
                                	  APP_DBG_MSG("-- GATT : SHIMANO_NOTIFY_CHAR_UUID FOUND  - \n");
#endif
                                	  int serv_idx = usedDeviceInformations[index].getServiceIndex(SHIMANO_SERVICE_UUID,&usedDeviceInformations[index]);
                                	  int charac_idx = usedDeviceInformations[index].services[serv_idx].appendCharacteristicName(SHIMANO_CHAR_UUID,
                                			  &usedDeviceInformations[index].services[serv_idx]);

                                	  if(charac_idx >= 0 ){
                                		  usedDeviceInformations[index].services[serv_idx].characteristics[charac_idx].charHandle = handle;
                                	  }

                                }
                                if (uuid == CYCLING_SPEED_CADENCE_FEATURE_CHAR_UUID && (usedDeviceInformations[index].sensorType == TRAINER || usedDeviceInformations[index].sensorType == CSC_SENSOR))
                                {
#if(CFG_DEBUG_APP_TRACE != 0)
                                	APP_DBG_MSG("-- GATT : SENSOR_READ_CHAR_UUID FOUND  - \n");
#endif

                              	    int serv_idx = usedDeviceInformations[index].getServiceIndex(CYCLING_SPEED_CADENCE_SERVICE_UUID,&usedDeviceInformations[index]);
                                	int charac_idx = usedDeviceInformations[index].services[serv_idx].appendCharacteristicName(CYCLING_SPEED_CADENCE_FEATURE_CHAR_UUID,
                                			  &usedDeviceInformations[index].services[serv_idx]);



                              	  if(charac_idx >= 0 ){
                              		  usedDeviceInformations[index].services[serv_idx].characteristics[charac_idx].charHandle = handle;
                              	  }

                                }
                                if (uuid == BATTERY_LEVEL_CHAR_UUID && (usedDeviceInformations[index].sensorType == SHIMANO_SENSOR || usedDeviceInformations[index].sensorType == CSC_SENSOR))
                                {
#if(CFG_DEBUG_APP_TRACE != 0)
                                	APP_DBG_MSG("-- GATT : BATTERY_LEVEL_CHAR_UUID FOUND  - \n");

#endif
                                  	//TODO should change stage to go read characteristics
                                  int serv_idx = usedDeviceInformations[index].getServiceIndex(BATTERY_SERVICE_UUID,&usedDeviceInformations[index]);
                                  int charac_idx = usedDeviceInformations[index].services[serv_idx].appendCharacteristicName(BATTERY_LEVEL_CHAR_UUID,
                                		&usedDeviceInformations[index].services[serv_idx]);

                                  if(charac_idx >= 0 ){
                                	  usedDeviceInformations[index].services[serv_idx].characteristics[charac_idx].charHandle = handle;
                                  }

