lilag-dawg/OSS_MCU/BLE_p2pRouteur/STM32_WPAN/App/p2p_routeur_app.c
                                }

                                if(uuid == CYCLING_POWER_MEASUREMENT_CHAR_UUID && (usedDeviceInformations[index].sensorType == TRAINER || usedDeviceInformations[index].sensorType == CSC_SENSOR))
								{
#if(CFG_DEBUG_APP_TRACE != 0)
									  APP_DBG_MSG("-- GATT : POWER_NOTIFY_CHAR_UUID FOUND  - \n");
#endif
	                              	  int serv_idx = usedDeviceInformations[index].getServiceIndex(CYCLING_POWER_SERVICE_UUID,&usedDeviceInformations[index]);
	                              	  int charac_idx = usedDeviceInformations[index].services[serv_idx].appendCharacteristicName(CYCLING_POWER_MEASUREMENT_CHAR_UUID,
	                              			  &usedDeviceInformations[index].services[serv_idx]);

	                              	  if(charac_idx >= 0 ){
	                              		  usedDeviceInformations[index].services[serv_idx].characteristics[charac_idx].charHandle = handle;
	                              	  }
								}

                                if(uuid_format_char==1){
                                    pr->Data_Length -= 21;
                                    idx += 21;
                                }
                                else if (uuid_format_char==0){
                                    pr->Data_Length -= 7;;
                                    idx += 7;;
                                }


                            }
                        }
                    }
                }
                break; //ok


                case EVT_BLUE_ATT_FIND_INFORMATION_RESP:
                {
                    /* USER CODE BEGIN EVT_BLUE_ATT_FIND_INFORMATION_RESP */

                    /* USER CODE END EVT_BLUE_ATT_FIND_INFORMATION_RESP */
                    aci_att_find_info_resp_event_rp0 *pr = (void*)blue_evt->data;

                    uint8_t numDesc, idx, i;
                    uint16_t uuid, handle;

                    /*
                     * event data will be of the format
                     * 2 bytes handle
                     * 2 bytes UUID
                     */

                    uint8_t index;

                    index = 0;
                    while((index < BLE_CFG_CLT_MAX_NBR_CB) &&
                            (usedDeviceInformations[index].connHandle != pr->Connection_Handle))

                        index++;

                    if(index < BLE_CFG_CLT_MAX_NBR_CB)
                    {

                        numDesc = (pr->Event_Data_Length) / 4;
                        /* we are interested only in 16 bit UUIDs */
                        idx = 0;
                        if (pr->Format == UUID_TYPE_16)
                        {
                            for (i=0; i<numDesc; i++)
                            {
                                handle = UNPACK_2_BYTE_PARAMETER(&pr->Handle_UUID_Pair[idx]);
                                uuid = UNPACK_2_BYTE_PARAMETER(&pr->Handle_UUID_Pair[idx+2]);

                                if(uuid == CLIENT_CHAR_CONFIG_DESCRIPTOR_UUID)
                                {
#if(CFG_DEBUG_APP_TRACE != 0)
                                    APP_DBG_MSG("-- GATT : CLIENT_CHAR_CONFIG_DESCRIPTOR_UUID - \n");
#endif
                                    if( usedDeviceInformations[index].state == APP_BLE_DISCOVER_NOTIFICATION_CHAR_DESC)
                                    {
                                    	int serv_idx = usedDeviceInformations[index].currentReadingInfo.serv_idx;
                                    	int char_idx = usedDeviceInformations[index].currentReadingInfo.char_idx;
                                    	usedDeviceInformations[index].services[serv_idx].characteristics[char_idx].descHandle = handle;


                                    }
                                }
                                idx += 4;
                            }
                        }
                    }
                }
                break; /*EVT_BLUE_ATT_FIND_INFORMATION_RESP*/ //ok

                case EVT_BLUE_GATT_NOTIFICATION:
                {
                    /* USER CODE BEGIN EVT_BLUE_GATT_NOTIFICATION */

                    /* USER CODE END EVT_BLUE_GATT_NOTIFICATION */
                    aci_gatt_notification_event_rp0 *pr = (void*)blue_evt->data;
                    uint8_t index;

                    index = 0;
                    while((index < BLE_CFG_CLT_MAX_NBR_CB) &&
                            (usedDeviceInformations[index].connHandle != pr->Connection_Handle))
                        index++;

                    if(index < BLE_CFG_CLT_MAX_NBR_CB)
                    {

                    	Characteristic_t *charac = getCharacteristic(pr->Attribute_Handle, &usedDeviceInformations[index]);

                    	switch(charac->name){
                    		case CYCLING_POWER_MEASUREMENT_CHAR_UUID:
								Notification.P2P_Client_Evt_Opcode = P2P_NOTIFICATION_CP_RECEIVED_EVT;
								break;
                    		case CYCLING_SPEED_CADENCE_MEASUREMENT_CHAR_UUID:
								Notification.P2P_Client_Evt_Opcode = P2P_NOTIFICATION_CSC_RECEIVED_EVT;
								break;
                    		case SHIMANO_CHAR_UUID:
                    			Notification.P2P_Client_Evt_Opcode = P2P_NOTIFICATION_SHIMANO_RECEIVED_EVT;
                    			break;
                    		default:
                    			break;
                    	}

                        Notification.DataTransfered.Length = pr->Attribute_Value_Length;
                        Notification.DataTransfered.pPayload = pr->Attribute_Value;
                        Notification.SensorType = usedDeviceInformations[index].sensorType;

                        P2P_Client_App_Notification(&Notification);

                    }
                }
                break;/* end EVT_BLUE_GATT_NOTIFICATION */

                case EVT_BLUE_ATT_READ_RESP:
                {

                	aci_att_read_resp_event_rp0 *pr = (void*)blue_evt->data;
                    uint8_t index;

                    index = 0;

