lilag-dawg/OSS_MCU/BLE_p2pRouteur/STM32_WPAN/App/p2p_routeur_app.c
                    while((index < BLE_CFG_CLT_MAX_NBR_CB) &&
                            (usedDeviceInformations[index].connHandle != pr->Connection_Handle))
                        index++;

                    /*if(usedDeviceInformations[index].servicesHandle.P2PcurrentCharBeingRead == CYCLING_SPEED_CADENCE_FEATURE_CHAR_UUID){
                        printf("\n\rvalue is");
                        for (int i = 0; i<pr->Event_Data_Length; i++){
                            printf("%x", pr->Attribute_Value[i]);
                        }
                        printf("\n\r");

                        usedDeviceInformations[index].supportedDataType.cadence = pr->Attribute_Value[0] & 0x2;
                        usedDeviceInformations[index].supportedDataType.speed = pr->Attribute_Value[0] & 0x1;
                    }

                    if(usedDeviceInformations[index].servicesHandle.P2PcurrentCharBeingRead == BATTERY_LEVEL_CHAR_UUID){
                        printf("\n\rvalue is");
                        for (int i = 0; i<pr->Event_Data_Length; i++){
                            printf("%x", pr->Attribute_Value[i]);
                        }
                        printf("\n\r");

                    }*/

                	break; //ok
                }
                case EVT_BLUE_GATT_PROCEDURE_COMPLETE:
                {
                    /* USER CODE BEGIN EVT_BLUE_GATT_PROCEDURE_COMPLETE */

                    /* USER CODE END EVT_BLUE_GATT_PROCEDURE_COMPLETE */
                    aci_gatt_proc_complete_event_rp0 *pr = (void*)blue_evt->data;
#if(CFG_DEBUG_APP_TRACE != 0)
                    APP_DBG_MSG("-- GATT : EVT_BLUE_GATT_PROCEDURE_COMPLETE \n");
                    APP_DBG_MSG("\n");
#endif
                    uint8_t index;
                    index = 0;
                    while((index < BLE_CFG_CLT_MAX_NBR_CB) &&
                            (usedDeviceInformations[index].connHandle != pr->Connection_Handle))
                        index++;

                    if(index < BLE_CFG_CLT_MAX_NBR_CB)
                    {
                        UTIL_SEQ_SetTask(  1<<CFG_TASK_SEARCH_SERVICE_ID, CFG_SCH_PRIO_0 );
                    }
                }
                break; /*EVT_BLUE_GATT_PROCEDURE_COMPLETE*/ //ok
                default:
                    /* USER CODE BEGIN ecode_default */

                    /* USER CODE END ecode_default */
                    break;
                }
            }

            break; /* HCI_EVT_VENDOR_SPECIFIC */

        default:
            /* USER CODE BEGIN evt_default */

            /* USER CODE END evt_default */
            break;
        }
/* USER CODE BEGIN Client_Event_Handler_2 */

/* USER CODE END Client_Event_Handler_2 */
        return(return_value);
    }/* end BLE_CTRL_Event_Acknowledged_Status_t */

/* USER CODE BEGIN FD_LOCAL_FUNCTIONS */

/* USER CODE END FD_LOCAL_FUNCTIONS */
/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
